###Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [40]:
import pandas as pd

In [41]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [43]:
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [44]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [49]:
movies_info =  movies.set_index( keys= 'movieId', drop= False)

top_films =  ratings.query('rating == {}'.format( 5))

best_film_id =  top_films['movieId'].value_counts().idxmax()

print( f'{ movies_info.loc[ best_film_id, "title"]} ')

Shawshank Redemption, The (1994)

###Задание 2get_movies_Data_Frame
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [31]:
power_data = pd.read_csv('power.csv')
sub_data = power_data.query('country in ("Latvia", "Lithuania", "Estonia") '
                            '& category in (4, 12, 21) & 2005 < year < 2010 & quantity >= 0')

print( f"Суммарное потребление: { sub_data['quantity'].sum()} ")

Суммарное потребление: 164555.0

###Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):

In [76]:
page_url = 'https://fortrader.org/quotes'

# Импортируем нужную нам страницу в df

df = pd.read_html(page_url)

In [78]:
df[2]

                      Название      Цена   Изменение Изменение(%)  Обновлено
0      Серебро Цена на серебро    14.004      -0.375       -2.608        NaN
1    Палладий Цена на Палладий  2199.150  нет данных   нет данных        NaN
2  Золото Цена золота на бирже  1621.080       -5.18        -0.32        NaN
3      Платина Цены на платину   727.000       -11.7         -1.6        NaN
4      Медь Цена меди на бирже     2.156  нет данных   нет данных        NaN